[
  {
    "id": 1,
    "title": "The ADHD Effect",
    "content": "ADHD symptoms and responses to them create predictable patterns that can damage relationships. Both partners contribute to these patterns.",
    "category": "Understanding"
  },
  {
    "id": 2,
    "title": "Two Time Zones",
    "content": "For people with ADHD, there are only two time zones: 'now' and 'not now.' This 'time tunnel vision' makes planning and time management challenging.",
    "category": "Understanding"
  },
  {
    "id": 3,
    "title": "Hyperfocus Courtship",
    "content": "During dating, the ADHD partner often hyperfocuses on their new love. This intense attention typically ends once the relationship becomes routine.",
    "category": "Understanding"
  },
  {
    "id": 4,
    "title": "Parent-Child Dynamic",
    "content": "The most destructive pattern: one spouse is always responsible while the other rarely is. This kills romantic and sexual connection.",
    "category": "Patterns"
  },
  {
    "id": 5,
    "title": "Try Differently, Not Harder",
    "content": "Create ADHD-sensitive routines instead of just increasing effort. Work WITH the ADHD brain, not against it.",
    "category": "Strategy"
  },
  {
    "id": 6,
    "title": "The Three-Legged Stool",
    "content": "Optimal treatment includes: physical changes (medication), behavioral changes (habits), and interaction strategies with your spouse.",
    "category": "Treatment"
  },
  {
    "id": 7,
    "title": "Trust Redefined",
    "content": "Trust can't be based on perfect follow-through. Base it on evidence that your partner is managing ADHD to the best of their ability.",
    "category": "Relationships"
  },
  {
    "id": 8,
    "title": "Emotional Hyper-Arousal",
    "content": "Many with ADHD have trouble regulating emotions, especially negative ones. They're easily triggered into irritability over minor things.",
    "category": "Understanding"
  },
  {
    "id": 9,
    "title": "Personal Boundaries",
    "content": "A boundary is a value or behavior essential to living as the person you wish to be. Focus on people issues, not 'thing' issues.",
    "category": "Strategy"
  },
  {
    "id": 10,
    "title": "The Gift of Attention",
    "content": "Validate your spouse by giving them focused attention. Make them feel seen and valued through your presence.",
    "category": "Connection"
  },
  {
    "id": 11,
    "title": "Cultivate Empathy First",
    "content": "Step 1 of healing: Understand what it's like to be in your partner's shoes, whether they have ADHD or not.",
    "category": "Steps"
  },
  {
    "id": 12,
    "title": "Feeling Unloved",
    "content": "Virtually all people with ADHD having marital issues feel 'different,' unloved, and unwanted. They long to be accepted as they are.",
    "category": "Understanding"
  },
  {
    "id": 13,
    "title": "Hidden Shame",
    "content": "Many people with ADHD hide a large amount of shame, sometimes compensating with bluster or retreat.",
    "category": "Understanding"
  },
  {
    "id": 14,
    "title": "Learning Conversations",
    "content": "Focus on understanding each other's perspectives without judgment. Your partner's opinion is just as legitimate as your own.",
    "category": "Communication"
  },
  {
    "id": 15,
    "title": "Validation Isn't Agreement",
    "content": "Validation is acknowledging your partner's logic is internally consistent, even if you disagree with their conclusion.",
    "category": "Communication"
  },
  {
    "id": 16,
    "title": "Five Core Concerns",
    "content": "Appreciation, Affiliation, Autonomy, Status, and Role. Meeting these basic human needs prevents conflict.",
    "category": "Communication"
  },
  {
    "id": 17,
    "title": "Verbal Cues",
    "content": "Develop agreed-upon words or phrases to redirect conversations that are escalating or to address sensitive topics.",
    "category": "Strategy"
  },
  {
    "id": 18,
    "title": "Both Need Treatment",
    "content": "The non-ADHD spouse may develop depression, anxiety, or anger issues. Both partners need support and healing.",
    "category": "Treatment"
  },
  {
    "id": 19,
    "title": "Stop Diagnosing",
    "content": "Non-ADHD spouses should stop diagnosing their partner's ADHD. Focus on specific relationship issues and your own behavior.",
    "category": "Strategy"
  },
  {
    "id": 20,
    "title": "The Little Voices",
    "content": "ADHD partner fears failure. Non-ADHD partner fears everything will fall apart. Both voices need to be addressed.",
    "category": "Understanding"
  },
  {
    "id": 21,
    "title": "Safe Communication",
    "content": "Create an environment where it's safe to communicate even around difficult ideas. This is the best defense against destructive patterns.",
    "category": "Communication"
  },
  {
    "id": 22,
    "title": "Tone Matters Most",
    "content": "Your tone of voice is the hardest part of communication. Frustration and anger trigger defensive responses.",
    "category": "Communication"
  },
  {
    "id": 23,
    "title": "Schedule Hard Talks",
    "content": "Organize conversations so you have specific times for difficult topics. This lightens the atmosphere for the rest of the week.",
    "category": "Strategy"
  },
  {
    "id": 24,
    "title": "Connection First",
    "content": "Put strengthening your connections first, getting things done second. Strong threads of connection make everything easier.",
    "category": "Connection"
  },
  {
    "id": 25,
    "title": "Respect Space",
    "content": "Respect either partner's need for space without giving up underlying connections. Some retreat provides strength.",
    "category": "Relationships"
  },
  {
    "id": 26,
    "title": "New Adventures Together",
    "content": "Doing new and exciting activities together improves feelings more than just spending time together.",
    "category": "Connection"
  },
  {
    "id": 27,
    "title": "Celebrate Successes",
    "content": "Celebrating successes is more powerful than showing support during difficulties. Focus on positives.",
    "category": "Connection"
  },
  {
    "id": 28,
    "title": "Build on Spontaneity",
    "content": "Spontaneity is a natural ADHD trait. Revel in it to add fun and excitement to your relationship.",
    "category": "Connection"
  },
  {
    "id": 29,
    "title": "Eradicate Blame",
    "content": "Eradicate the blame game completely. Blame is destructive and doesn't lead to positive change.",
    "category": "Strategy"
  },
  {
    "id": 30,
    "title": "Step Out of Anger",
    "content": "Step out of the cycle of anger rather than continuing destructive patterns of expressing or suppressing it.",
    "category": "Strategy"
  },
  {
    "id": 31,
    "title": "ADHD Is Biological",
    "content": "ADHD has a biological basis involving dysregulation of the reward system, primarily dopamine. It's not laziness.",
    "category": "Understanding"
  },
  {
    "id": 32,
    "title": "Medication Jump-Starts",
    "content": "Medication makes changing habits easier by addressing brain differences, but it's not sufficient alone.",
    "category": "Treatment"
  },
  {
    "id": 33,
    "title": "ACBD Rule",
    "content": "Always Consult Before Deciding. This simple rule avoids conflict around issues of autonomy.",
    "category": "Strategy"
  },
  {
    "id": 34,
    "title": "Autonomy Without War",
    "content": "Declare autonomy without declaring war. Be autonomous but stay connected around positive things.",
    "category": "Relationships"
  },
  {
    "id": 35,
    "title": "Change Takes Time",
    "content": "Remember that change takes time. Progress is gradual and requires patience and persistence.",
    "category": "Progress"
  },
  {
    "id": 36,
    "title": "Applaud Progress",
    "content": "Applaud your progress and celebrate small wins. Recognizing progress reinforces positive changes.",
    "category": "Progress"
  },
  {
    "id": 37,
    "title": "Seek ADHD-Informed Help",
    "content": "Seek help from people who understand ADHD. General therapists may not understand the specific dynamics.",
    "category": "Treatment"
  },
  {
    "id": 38,
    "title": "The True Self",
    "content": "ADHD symptoms are NOT the person's true qualities. They're actually the opposite of who they really are when managed.",
    "category": "Understanding"
  },
  {
    "id": 39,
    "title": "Efficiency vs. Connection",
    "content": "Efficiency is relatively unimportant compared to connection and respect, except when children rely on you.",
    "category": "Relationships"
  },
  {
    "id": 40,
    "title": "The Ultimate Goal",
    "content": "Take control of ADHD together so you can thrive and become, once again, the partners you hoped to be.",
    "category": "Progress"
  }
]
